# PerformanceAdviserRuleId Properties

---
The PerformanceAdviserRuleId type exposes the following members.
| Name| Description
---|---|---
| Guid|  The Guid of GUID-based enum object. (Inherited from GuidEnum)
Top
#### Reference
PerformanceAdviserRuleId Class
Autodesk.Revit.DB Namespace